In [12]:
## importing libraries

import pandas as pd
import warnings
import datetime 
warnings.filterwarnings('ignore')

In [13]:
## loading all customer data

customer = pd.read_csv('Client master dt 17-10-2023.csv')
AP_who_are_customer = pd.read_excel("AP_UCC list.xlsx")
employee_customer = pd.read_excel('Employee_UCC List.xlsx')
outside_customer = pd.read_csv('outside_customer.csv')

In [14]:
customer.head()

  Client Code Ucc Code                        Name Branch Ac Open Date
0      AAB803   AAB803               ABHISHEK GITE     HO    07-Sep-23
1      AAB797   AAB797                   NEHA JAIN   MB01    07-Sep-23
2      AAB781   AAB781             JITENDRA ADVANI     HO    04-Sep-23
3      AAB630   AAB630        PRIYANKA VIJAY MATAI   DU01    18-Aug-23
4      AAB761   AAB761  RUCHITA HARISHANKAR MAURYA     HO    01-Sep-23

In [15]:
customer.tail()

     Client Code Ucc Code                      Name Branch Ac Open Date
1198      AAA297   AAA297     KIRAN UMESH DESHPANDE     HO    23-Dec-22
1199      AAA950   AAA950       VARUN NILESH SURANA     HO    29-May-23
1200      AAA811   AAA811  JAYALAXMI RAMESH BHUJANG     HO    24-May-23
1201      AAA860   AAA860         JUNERI ALOK MEHTA     HO    23-May-23
1202      AAA901   AAA901      JITENDRAKUMAR SIPANI   SS02    26-May-23

In [16]:
total_number_customer = customer['Client Code'].count()

In [17]:
total_number_customer

1203

In [18]:
# Creating a function to drop certain rows based on certain certain condition

def drop_rows_by_condition(dataframe, condition):
    return dataframe[~condition]

In [19]:
#droping customer with branch HO and HO01
AP_Customer = drop_rows_by_condition(customer, (customer['Branch'] == 'HO') | (customer['Branch'] == 'HO01'))

In [20]:
AP_Customer.head()

   Client Code Ucc Code                        Name Branch Ac Open Date
1       AAB797   AAB797                   NEHA JAIN   MB01    07-Sep-23
3       AAB630   AAB630        PRIYANKA VIJAY MATAI   DU01    18-Aug-23
7       AAB908   AAB908    SHITAL KANTILAL KHATRANI  RSS04    26-Sep-23
13      AAB936   AAB936  JAYSHREEBEN ANANTRAI RAVAL   AT01    04-Oct-23
15      AAB980   AAB980         JAYDIP VASANT GODSE  RKG02    12-Oct-23

In [21]:
AP_Customer_count = AP_Customer['Client Code'].count()

In [22]:
AP_Customer_count

395

In [23]:
unique_AP_brought_customer = AP_Customer['Branch'].nunique()

In [24]:
unique_AP_brought_customer ##Number of AP who have brought customers

80

In [25]:
Groupby_AP = AP_Customer.groupby(['Branch','Ucc Code']).sum()

In [26]:
Groupby_AP.head()

                Client Code                        Name Ac Open Date
Branch Ucc Code
AD01   AAA395        AAA395  RAMKISHOR RAMJIVANJI DARAK    23-Jan-23
       AAA481        AAA481     KUSUM NAWALKISHORE SONI    10-Apr-23
       AAB282        AAB282      SUMEET RAMKISHOR DARAK    05-Jun-23
       AAB383        AAB383        SALONI KAILASH DARAK    16-Jun-23
       AAB392        AAB392      SONAKSHI KAILASH DARAK    21-Jun-23

In [27]:
AP_who_are_customer.head()

      UCC            Clients Name         PAN
0  AAB886        AKASH PRALATHIYA  FZKPP0419L
1  AAB919  CHIRAG GIRISH UPADHYAY  ADMPU5579M
2  AAB948       GIRDHARI LAL SONI  ANQPS6222D
3  AAB850         KRATIKA AGARWAL  DLQPA7653K
4  AAB353   KISHORE MANOHAR ANGNE  ABPPA0799N

In [28]:
AP_who_are_customer.tail()

       UCC                     Clients Name         PAN
76  AAB621                        RAJ KUMAR  AVOPK5207C
77  AAB511              SIDDHARTH SHANKARAN  DGGPS0234D
78  AAB402              SMITA SANDEEP KUNTE  ACEPK2841F
79  AAA378  NIRMALKUMAR LAXMICHAND JAKHOTIA  AACPJ8127D
80  AAA354                      HARSH DARAK  CQHPD5080N

In [29]:
AP_who_are_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81 entries, 0 to 80
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   UCC           81 non-null     object
 1   Clients Name  81 non-null     object
 2   PAN           81 non-null     object
dtypes: object(3)
memory usage: 2.0+ KB

In [30]:
count_of_AP_who_are_customer = AP_who_are_customer['UCC'].nunique() #Number of AP who are customer

In [31]:
count_of_AP_who_are_customer

81

In [32]:
employee_customer.head()

   Sr. No.               Name of Employee     UCC
0        1  Suresh Kumar Ganpat Lal Darak  AAA303
1        3                   Vatsal Gudka  AAA298
2        5                  Siddhi Rawool  AAA330
3        6             Isha Sameer Kamdar  AAA292
4        7                     Amol Gawde  AAA337

In [33]:
employee_customer.tail()

    Sr. No.                 Name of Employee     UCC
59       64                   Shweta Sakpal   AAB711
60       65                     Karthik Rao   AAB710
61       66                   Pradeep Gurav   AAA727
62       67  Bondbazaar Securities Pvt. Ltd.     OWN
63       68    Bondbazaar Services Pvt. Ltd.  PAA002

In [34]:
employee_customer_count = employee_customer['UCC'].count()

In [35]:
employee_customer_count #number of employees who are customer

64

In [36]:
outside_client = outside_customer['Ucc Code'].count()

In [37]:
outside_client #total outside customer after removing employees/APS/APS customer from the total customer

679

In [38]:
total_number_customer = outside_client+employee_customer_count+count_of_AP_who_are_customer+AP_Customer_count

In [39]:

data = {
    'Category': ['Total Customers', 'AP Who Are Customers', 'Customers Brought by AP', 'Employees Who Are Customers', 'Outside Customers'],
    'Count': [total_number_customer, count_of_AP_who_are_customer, AP_Customer_count, employee_customer_count, outside_client]
}
customer_overview = pd.DataFrame(data)

In [40]:
customer_overview

                      Category  Count
0              Total Customers   1219
1         AP Who Are Customers     81
2      Customers Brought by AP    395
3  Employees Who Are Customers     64
4            Outside Customers    679

In [41]:
customer.head()

  Client Code Ucc Code                        Name Branch Ac Open Date
0      AAB803   AAB803               ABHISHEK GITE     HO    07-Sep-23
1      AAB797   AAB797                   NEHA JAIN   MB01    07-Sep-23
2      AAB781   AAB781             JITENDRA ADVANI     HO    04-Sep-23
3      AAB630   AAB630        PRIYANKA VIJAY MATAI   DU01    18-Aug-23
4      AAB761   AAB761  RUCHITA HARISHANKAR MAURYA     HO    01-Sep-23

In [42]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1203 entries, 0 to 1202
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Client Code   1203 non-null   object
 1   Ucc Code      1203 non-null   object
 2   Name          1203 non-null   object
 3   Branch        1203 non-null   object
 4   Ac Open Date  1203 non-null   object
dtypes: object(5)
memory usage: 47.1+ KB

In [43]:
customer['Ac Open Date'] = pd.to_datetime(customer['Ac Open Date'], format='%d-%b-%y') #converting the date into proper datetime format

In [44]:
customer.head()

  Client Code Ucc Code                        Name Branch Ac Open Date
0      AAB803   AAB803               ABHISHEK GITE     HO   2023-09-07
1      AAB797   AAB797                   NEHA JAIN   MB01   2023-09-07
2      AAB781   AAB781             JITENDRA ADVANI     HO   2023-09-04
3      AAB630   AAB630        PRIYANKA VIJAY MATAI   DU01   2023-08-18
4      AAB761   AAB761  RUCHITA HARISHANKAR MAURYA     HO   2023-09-01

In [45]:
dangal_start_date = pd.to_datetime('5/10/2023') #dangal start date

In [46]:
dangal_start_date

Timestamp('2023-05-10 00:00:00')

In [47]:
dangal_end_date =  pd.to_datetime('6/19/2023') #dangal end date

In [48]:
dangal_end_date

Timestamp('2023-06-19 00:00:00')

In [49]:
condition = (customer['Ac Open Date'] >= dangal_start_date) & (customer['Ac Open Date'] <= dangal_end_date)

# Spliting the data based on dangal customer and normal customer
dangal_customer = customer[condition]
outside_dangal_customer = customer[~condition]

In [50]:
dangal_customer.rename(columns={'Ucc Code':'UCC'},inplace = True)

In [51]:
dangal_customer.head()

   Client Code     UCC                    Name Branch Ac Open Date
14      AAA827  AAA827     SNEHA SUBHASH DHURI     HO   2023-05-22
33      AAA713  AAA713            SWATI PODDAR   SG01   2023-05-23
48      AAB301  AAB301  DANISH NAZIM ALI SAYED   HS01   2023-06-06
49      AAA569  AAA569       PRITI RAMNIK DUBE     HO   2023-05-12
52      AAA586  AAA586      JEYA PETER DICKSON     HO   2023-05-15

In [52]:
dangal_customer.info()

<class 'pandas.core.frame.DataFrame'>
Index: 472 entries, 14 to 1202
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Client Code   472 non-null    object
 1   UCC           472 non-null    object
 2   Name          472 non-null    object
 3   Branch        472 non-null    object
 4   Ac Open Date  472 non-null    datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 22.1+ KB

In [53]:
outside_dangal_customer.head()

  Client Code Ucc Code                        Name Branch Ac Open Date
0      AAB803   AAB803               ABHISHEK GITE     HO   2023-09-07
1      AAB797   AAB797                   NEHA JAIN   MB01   2023-09-07
2      AAB781   AAB781             JITENDRA ADVANI     HO   2023-09-04
3      AAB630   AAB630        PRIYANKA VIJAY MATAI   DU01   2023-08-18
4      AAB761   AAB761  RUCHITA HARISHANKAR MAURYA     HO   2023-09-01

In [54]:
outside_dangal_customer.info()

<class 'pandas.core.frame.DataFrame'>
Index: 731 entries, 0 to 1198
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Client Code   731 non-null    object
 1   Ucc Code      731 non-null    object
 2   Name          731 non-null    object
 3   Branch        731 non-null    object
 4   Ac Open Date  731 non-null    datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 34.3+ KB

In [55]:
#customer came during dangal period through AP
ap_customer_dangal = drop_rows_by_condition(dangal_customer,(customer['Branch'] == 'HO') | (customer['Branch'] == 'HO01'))

In [56]:
ap_customer_dangal.head()

   Client Code     UCC                        Name Branch Ac Open Date
33      AAA713  AAA713                SWATI PODDAR   SG01   2023-05-23
48      AAB301  AAB301      DANISH NAZIM ALI SAYED   HS01   2023-06-06
56      AAA715  AAA715             MUSKAN BHANDARI   SD01   2023-05-18
61      AAA760  AAA760        NEETA SHEWARAM UDASI   DU01   2023-05-18
66      AAA668  AAA668  SARAL SATISH KUMAR SARANGI   SG01   2023-05-17

In [47]:
ap_customer_dangal.info()

<class 'pandas.core.frame.DataFrame'>
Index: 104 entries, 33 to 1202
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Client Code   104 non-null    object
 1   UCC           104 non-null    object
 2   Name          104 non-null    object
 3   Branch        104 non-null    object
 4   Ac Open Date  104 non-null    datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 4.9+ KB

In [48]:
ap_customer_dangal['UCC'].count() #number of customer came during dangal period through AP

104

In [49]:
AP_who_are_customer.head()

      UCC            Clients Name         PAN
0  AAB886        AKASH PRALATHIYA  FZKPP0419L
1  AAB919  CHIRAG GIRISH UPADHYAY  ADMPU5579M
2  AAB948       GIRDHARI LAL SONI  ANQPS6222D
3  AAB850         KRATIKA AGARWAL  DLQPA7653K
4  AAB353   KISHORE MANOHAR ANGNE  ABPPA0799N

In [50]:
ap_customer_dangal.head()

   Client Code     UCC                        Name Branch Ac Open Date
33      AAA713  AAA713                SWATI PODDAR   SG01   2023-05-23
48      AAB301  AAB301      DANISH NAZIM ALI SAYED   HS01   2023-06-06
56      AAA715  AAA715             MUSKAN BHANDARI   SD01   2023-05-18
61      AAA760  AAA760        NEETA SHEWARAM UDASI   DU01   2023-05-18
66      AAA668  AAA668  SARAL SATISH KUMAR SARANGI   SG01   2023-05-17

In [51]:
AP_who_are_customer.columns

Index(['UCC', 'Clients Name', 'PAN'], dtype='object')

In [52]:
dangal_customer.columns

Index(['Client Code', 'UCC', 'Name', 'Branch', 'Ac Open Date'], dtype='object')

In [53]:
AP_who_are_customer_dangal = pd.merge(AP_who_are_customer,ap_customer_dangal,how = 'inner',on = 'UCC')

In [54]:
AP_who_are_customer_dangal['Client Code'].count()

1

In [55]:
employee_customer.head()

   Sr. No.               Name of Employee     UCC
0        1  Suresh Kumar Ganpat Lal Darak  AAA303
1        3                   Vatsal Gudka  AAA298
2        5                  Siddhi Rawool  AAA330
3        6             Isha Sameer Kamdar  AAA292
4        7                     Amol Gawde  AAA337

In [56]:
employee_customer_dangal = pd.merge(employee_customer,dangal_customer,on = 'UCC',how = 'inner')

In [57]:
employee_customer_dangal.head()

,Sr. No.,Name of Employee,UCC,Client Code,Name,Branch,Ac Open Date
0,7,Amol Gawde,AAA337,AAA337,AMOL CHANDRKANT GAWDE,HO,2023-06-06
1,10,Akshay Narkar,AAB373,AAB373,AKSHAY ANKUSH NARKAR,HO,2023-06-14
2,16,Prasant Sinha,AAA766,AAA766,PRASHANT SINHA,HO,2023-05-18
3,18,Pramod Dubey,AAB378,AAB378,PRAMOD BABULAL DUBEY,HO,2023-06-15
4,38,Ishwari Surashe,AAA888,AAA888,ISHWARI EKNATH SURASHE,HO,2023-05-25

In [58]:
employee_customer_dangal

,Sr. No.,Name of Employee,UCC,Client Code,Name,Branch,Ac Open Date
0,7,Amol Gawde,AAA337,AAA337,AMOL CHANDRKANT GAWDE,HO,2023-06-06
1,10,Akshay Narkar,AAB373,AAB373,AKSHAY ANKUSH NARKAR,HO,2023-06-14
2,16,Prasant Sinha,AAA766,AAA766,PRASHANT SINHA,HO,2023-05-18
3,18,Pramod Dubey,AAB378,AAB378,PRAMOD BABULAL DUBEY,HO,2023-06-15
4,38,Ishwari Surashe,AAA888,AAA888,ISHWARI EKNATH SURASHE,HO,2023-05-25
5,40,Sujata Said,AAA697,AAA697,SUJATA SURESH SAID,HO,2023-05-17
6,41,Priti Dube,AAA569,AAA569,PRITI RAMNIK DUBE,HO,2023-05-12
7,52,Siddhesh Mathur,AAA875,AAA875,SIDDHESH MUKESH MATHUR,HO,2023-06-01
8,53,Anand Jha,AAA855,AAA855,ANAND LAXMAN JHA,HO,2023-05-23
9,55,Gurpreet Sabarwal,AAB350,AAB350,GURPREET KAUR BALVINDAR SINGH SABARWAL,HS01,2023-06-12
10,56,Varenya Gutgutia,AAB364,AAB364,VARENYA GUTGUTIA,HO,2023-06-13
11,66,Pradeep Gurav,AAA727,AAA727,PRADEEP RAJARAM GURAV,HO,2023-05-18

In [59]:
employee_customer_dangal['Client Code'].count() #Employees who became customer during dangal period

12

In [60]:
dangal_customer['UCC'].count()

472

In [61]:
customer_overview

                      Category  Count
0              Total Customers   1203
1         AP Who Are Customers     81
2      Customers Brought by AP    395
3  Employees Who Are Customers     64
4            Outside Customers    663

In [62]:
dangal_total_customer = dangal_customer['UCC'].count()

In [63]:
dangal_count_of_AP_who_are_customer =  AP_who_are_customer_dangal['Client Code'].count()

In [64]:
dangal_AP_Customer_count = ap_customer_dangal['UCC'].count()

In [65]:
dangal_employee_customer_count = employee_customer_dangal['Client Code'].count()

In [66]:
dangal_outside_client = dangal_total_customer - dangal_count_of_AP_who_are_customer - dangal_AP_Customer_count - dangal_employee_customer_count

In [67]:
data1 = {
    'Category': ['Total Customers', 'AP Who Are Customers', 'Customers Brought by AP', 'Employees Who Are Customers', 'Outside Customers'],
    'Count': [dangal_total_customer, dangal_count_of_AP_who_are_customer, dangal_AP_Customer_count, dangal_employee_customer_count, dangal_outside_client]
}
dangal_customer_overview = pd.DataFrame(data1)

In [68]:
dangal_customer_overview

                      Category  Count
0              Total Customers    472
1         AP Who Are Customers      1
2      Customers Brought by AP    104
3  Employees Who Are Customers     12
4            Outside Customers    355

In [69]:
data = {
    'Category': ['Total Customers', 'AP Who Are Customers', 'Customers Brought by AP', 'Employees Who Are Customers', 'Outside Customers'],
    'Count': [total_number_customer, count_of_AP_who_are_customer, AP_Customer_count, employee_customer_count, outside_client]
}
customer_overview = pd.DataFrame(data)

In [79]:
outside_dangal_customer.head()

  Client Code Ucc Code                        Name Branch Ac Open Date
0      AAB803   AAB803               ABHISHEK GITE     HO   2023-09-07
1      AAB797   AAB797                   NEHA JAIN   MB01   2023-09-07
2      AAB781   AAB781             JITENDRA ADVANI     HO   2023-09-04
3      AAB630   AAB630        PRIYANKA VIJAY MATAI   DU01   2023-08-18
4      AAB761   AAB761  RUCHITA HARISHANKAR MAURYA     HO   2023-09-01

In [81]:
total_outside_customer = outside_dangal_customer['Ucc Code'].count()

In [82]:
total_outside_customer

731

In [84]:
outside_dangal_customer.rename(columns = {'Ucc Code':'UCC'},inplace = True)

In [85]:
outside_dangal_customer.head()

  Client Code     UCC                        Name Branch Ac Open Date
0      AAB803  AAB803               ABHISHEK GITE     HO   2023-09-07
1      AAB797  AAB797                   NEHA JAIN   MB01   2023-09-07
2      AAB781  AAB781             JITENDRA ADVANI     HO   2023-09-04
3      AAB630  AAB630        PRIYANKA VIJAY MATAI   DU01   2023-08-18
4      AAB761  AAB761  RUCHITA HARISHANKAR MAURYA     HO   2023-09-01

In [91]:
ap_who_are_custome_outside_dangal = pd.merge(AP_who_are_customer,outside_dangal_customer,on = 'UCC',how = 'left')

In [92]:
ap_who_are_custome_outside_dangal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81 entries, 0 to 80
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   UCC           81 non-null     object
 1   Clients Name  81 non-null     object
 2   PAN           81 non-null     object
 3   Client Code   64 non-null     object
 4   Name          64 non-null     object
 5   Branch        64 non-null     object
 6   Ac Open Date  64 non-null     datetime64[ns]
dtypes: datetime64[ns](1), object(6)
memory usage: 4.6+ KB

In [88]:
ap_who_are_custome_outside_dangal = ap_who_are_custome_outside_dangal.dropna()

In [89]:
ap_who_are_custome_outside_dangal.head()

,UCC,Clients Name,PAN,Client Code,Name,Branch,Ac Open Date
0,AAB886,AKASH PRALATHIYA,FZKPP0419L,AAB886,AKASH PRALATHIYA,HO,2023-09-21
1,AAB919,CHIRAG GIRISH UPADHYAY,ADMPU5579M,AAB919,CHIRAG GIRISH UPADHYAY,HO,2023-09-28
2,AAB948,GIRDHARI LAL SONI,ANQPS6222D,AAB948,GIRDHARI LAL SONI,HO,2023-10-04
3,AAB850,KRATIKA AGARWAL,DLQPA7653K,AAB850,KRATIKA AGARWAL,HO,2023-09-12
9,AAA373,PURUSHOTTAM DARAK,AECPD3570L,AAA373,PURUSHOTTAM DARAK,HO,2023-01-09

In [90]:
ap_who_are_custome_outside_dangal.info()

<class 'pandas.core.frame.DataFrame'>
Index: 64 entries, 0 to 80
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   UCC           64 non-null     object
 1   Clients Name  64 non-null     object
 2   PAN           64 non-null     object
 3   Client Code   64 non-null     object
 4   Name          64 non-null     object
 5   Branch        64 non-null     object
 6   Ac Open Date  64 non-null     datetime64[ns]
dtypes: datetime64[ns](1), object(6)
memory usage: 4.0+ KB

In [93]:
customer_brought_by_ap_outside_dangal = drop_rows_by_condition(outside_dangal_customer,((customer['Branch'] == 'HO') | (customer['Branch'] == 'HO01')))

In [94]:
customer_brought_by_ap_outside_dangal.head()

   Client Code     UCC                        Name Branch Ac Open Date
1       AAB797  AAB797                   NEHA JAIN   MB01   2023-09-07
3       AAB630  AAB630        PRIYANKA VIJAY MATAI   DU01   2023-08-18
7       AAB908  AAB908    SHITAL KANTILAL KHATRANI  RSS04   2023-09-26
13      AAB936  AAB936  JAYSHREEBEN ANANTRAI RAVAL   AT01   2023-10-04
15      AAB980  AAB980         JAYDIP VASANT GODSE  RKG02   2023-10-12

In [95]:
customer_brought_by_ap_outside_dangal['Client Code'].count()

291

In [96]:
employee_customer_outside_dangal = pd.merge(employee_customer,outside_dangal_customer,on = 'UCC',how = 'inner')

In [97]:
employee_customer_outside_dangal.head()

,Sr. No.,Name of Employee,UCC,Client Code,Name,Branch,Ac Open Date
0,1,Suresh Kumar Ganpat Lal Darak,AAA303,AAA303,SURESH KUMAR GANPAT LAL DARAK,HO,2022-11-21
1,3,Vatsal Gudka,AAA298,AAA298,VATSAL AMIT GUDKA,HO,2022-11-17
2,5,Siddhi Rawool,AAA330,AAA330,SIDDHI BHALCHANDRA RAWOOL,HO,2022-12-05
3,6,Isha Sameer Kamdar,AAA292,AAA292,ISHA SAMEER KAMDAR,SK01,2022-11-15
4,8,Samir Agarwal,AAA293,AAA293,SAMIR AGARWAL,HO,2022-11-16

In [99]:
employee_customer_outside_dangal['UCC'].count()

52

In [100]:
employee_customer_outside_dangal[employee_customer_outside_dangal['Branch']!='HO']

,Sr. No.,Name of Employee,UCC,Client Code,Name,Branch,Ac Open Date
3,6,Isha Sameer Kamdar,AAA292,AAA292,ISHA SAMEER KAMDAR,SK01,2022-11-15
9,14,Harsha Khorana,AAB698,AAB698,UDAY PARASHURAM RENAKE,PD02,2023-08-29
16,23,Kiran Bapurao Pawar,AAA230,AAA230,KIRAN BAPURAO PAWAR,HS01,2022-10-11
22,30,Juned Shaikh,AAA336,AAA336,MOHAMMED JUNED MOHAMMED SAUD SHAIKH,HS01,2023-01-02
25,33,Shashank Verma,AAA305,AAA305,SHASHANK KUMAR VERMA,SG01,2022-11-29
36,47,Deepti Chavan,AAA410,AAA410,DEEPTI PRASAD CHAVAN,HS01,2023-01-27

In [70]:
normal_period_total_customer = total_number_customer-dangal_total_customer

In [71]:
normal_period_ap_who_are_customer = count_of_AP_who_are_customer - dangal_count_of_AP_who_are_customer

In [72]:
normal_period_customer_brought_by_ap = AP_Customer_count-dangal_AP_Customer_count

In [73]:
normal_priod_employee_customer = employee_customer_count - dangal_employee_customer_count

In [74]:
normal_period = outside_client-dangal_outside_client

In [75]:
data3 = {
    'Category': ['Total Customers', 'AP Who Are Customers', 'Customers Brought by AP', 'Employees Who Are Customers', 'Outside Customers'],
    'Count': [normal_period_total_customer, normal_period_ap_who_are_customer, normal_period_customer_brought_by_ap, normal_priod_employee_customer, normal_period]
}
Normal_period_customer_overview = pd.DataFrame(data3)

In [76]:
customer_overview

                      Category  Count
0              Total Customers   1203
1         AP Who Are Customers     81
2      Customers Brought by AP    395
3  Employees Who Are Customers     64
4            Outside Customers    663

In [77]:
dangal_customer_overview

                      Category  Count
0              Total Customers    472
1         AP Who Are Customers      1
2      Customers Brought by AP    104
3  Employees Who Are Customers     12
4            Outside Customers    355

In [78]:
Normal_period_customer_overview

                      Category  Count
0              Total Customers    731
1         AP Who Are Customers     80
2      Customers Brought by AP    291
3  Employees Who Are Customers     52
4            Outside Customers    308